def decode(i: str) -> str:
    patterns = {
        "(ᒧᆞωᆞ)": "(/ᆞωᆞ/)",
        "(ᒧᆞωᆞ).ᒧうー": "-0",
        "(〳ᆞωᆞ)": "(ᒧᆞωᆞ)",
        "(〳ᆞωᆞ).〳にゃー": "1",
        "(ᒧᆞωᆞ).ᒧうーｰ": "2",
        "(〳ᆞωᆞ).〳にゃーｰ": "3",
        "(ᒧᆞωᆞ).ᒧうーー": "4",
        "(〳ᆞωᆞ).〳にゃーー": "5",
        "(ᒧᆞωᆞ).ᒧうーｰｰ": "6",
        "(〳ᆞωᆞ).〳にゃーｰｰ": "7",
        "(ᒧᆞωᆞ).ᒧうーｰー": "8",
        "(〳ᆞωᆞ).〳にゃーｰー": "9",
        "ｰ": '""',
        "(ᒧᆞωᆞ).ᒧうーーｰ": "'true'",
        "(〳ᆞωᆞ).〳にゃーーｰ": "'false'",
        "(ᒧᆞωᆞ).ᒧうーーー": "'[object obejct]'",
        "(〳ᆞωᆞ).〳にゃーーー": "'undefined'",
        "(ᆞωᆞᒪ)": "-0",
        "(ｺᆞωᆞ)": "-0",
        "(ᒧᆞωᆞ).ᒧうーｰｰｰ": "'a'",
        "(〳ᆞωᆞ).〳にゃーｰｰｰ": "'b'",
        "(ᒧᆞωᆞ).ᒧうーｰｰー": "'c'",
        "(〳ᆞωᆞ).〳にゃーｰｰー": "'d'",
        "(ᒧᆞωᆞ).ᒧうーｰーｰ": "'e'",
        "(〳ᆞωᆞ).〳にゃーｰーｰ": "'f'",
        "(ᒧᆞωᆞ).ᒧうーｰーー": "'n'",
        "(〳ᆞωᆞ).〳にゃーｰーー": "'o'",
        "(ᒧᆞωᆞ).ᒧうーーｰｰ": "'r'",
        "(〳ᆞωᆞ).〳にゃーーｰｰ": "'s'",
        "(ᒧᆞωᆞ).ᒧうーーｰー": "'t'",
        "(〳ᆞωᆞ).〳にゃーーｰー": "'u'",
        "(ᒧᆞωᆞ).ᒧうーーーｰ": '\'/""ω""//\\\\ω\\\\/\'',
        "(〳ᆞωᆞ).〳にゃーーーｰ": "'\"'",
        "(ᒧᆞωᆞ).ᒧうーーーー": "'\"\\\\\"'",
        "(〳ᆞωᆞ).〳にゃーーーー": "'\"\\\\u\"'",
        "(ᒧᆞωᆞ).ᒧうーｰｰｰｰ": "'\\\\u00'",
        "(〳ᆞωᆞ).〳にゃーｰｰｰｰ": "'constructor'",
    }

    res = ""

    for s in i.split(" "):
        if s in patterns:
            res += patterns[s] + " "
        else:
            res += s + " "

    return res[:-1]


def main():
    i = ""
    while True:
        ii = input()
        if ii != "":
            i += ii
        else:
            break

    o = decode(i)
    print(o)


if __name__ == "__main__":
    main()